MikroElektronika/core_packages/ARM/gcc_clang/def/stm/STM32H7B0IB/mcu.h
/* Legacy define */
#define FLASH_BASE                FLASH_BANK1_BASE
#define D1_AXISRAM_BASE           CD_AXISRAM1_BASE

#define FLASH_OTP_BASE            (0x08FFF000UL) /*!< Base address of : (up to 1KB) embedded FLASH Bank1 OTP Area                           */
#define FLASH_OTP_END             (0x08FFF3FFUL) /*!< End address of : (up to 1KB) embedded FLASH Bank1 OTP Area                            */


/*!< Device electronic signature memory map */
#define UID_BASE                  (0x08FFF800UL)            /*!< Unique device ID register base address */
#define FLASHSIZE_BASE            (0x08FFF80CUL)            /*!< FLASH Size register base address */
#define PACKAGE_BASE              (0x08FFF80EUL)            /*!< Package Data register base address */

#define PERIPH_BASE               (0x40000000UL) /*!< Base address of : AHB/ABP Peripherals                                                    */
/*!< Peripheral memory map */
#define CD_APB1PERIPH_BASE        PERIPH_BASE                   /*!<  D2_APB1PERIPH_BASE        PERIPH_BASE                                    */
#define CD_APB2PERIPH_BASE       (PERIPH_BASE + 0x00010000UL)   /*!<  D2_APB2PERIPH_BASE       (PERIPH_BASE + 0x00010000UL)                    */
#define CD_AHB1PERIPH_BASE       (PERIPH_BASE + 0x00020000UL)   /*!<  D2_AHB1PERIPH_BASE       (PERIPH_BASE + 0x00020000UL)                    */
#define CD_AHB2PERIPH_BASE       (PERIPH_BASE + 0x08020000UL)   /*!<  D2_AHB2PERIPH_BASE       (PERIPH_BASE + 0x08020000UL)                    */

#define CD_APB3PERIPH_BASE       (PERIPH_BASE + 0x10000000UL)   /*!<  D1_APB1PERIPH_BASE       (PERIPH_BASE + 0x10000000UL)                    */
#define CD_AHB3PERIPH_BASE       (PERIPH_BASE + 0x12000000UL)   /*!<  D1_AHB1PERIPH_BASE       (PERIPH_BASE + 0x12000000UL)                    */

#define SRD_APB4PERIPH_BASE      (PERIPH_BASE + 0x18000000UL)   /*!<  D3_APB1PERIPH_BASE       (PERIPH_BASE + 0x18000000UL)                    */
#define SRD_AHB4PERIPH_BASE      (PERIPH_BASE + 0x18020000UL)   /*!<  D3_AHB1PERIPH_BASE       (PERIPH_BASE + 0x18020000UL)                    */

/*!< Legacy Peripheral memory map */
#define APB1PERIPH_BASE        PERIPH_BASE
#define APB2PERIPH_BASE       (PERIPH_BASE + 0x00010000UL)
#define AHB1PERIPH_BASE       (PERIPH_BASE + 0x00020000UL)
#define AHB2PERIPH_BASE       (PERIPH_BASE + 0x08020000UL)

/*!< CD_AHB3PERIPH peripherals */
#define MDMA_BASE             (CD_AHB3PERIPH_BASE + 0x0000UL)
#define DMA2D_BASE            (CD_AHB3PERIPH_BASE + 0x1000UL)
#define FLASH_R_BASE          (CD_AHB3PERIPH_BASE + 0x2000UL)
#define JPGDEC_BASE           (CD_AHB3PERIPH_BASE + 0x3000UL)
#define FMC_R_BASE            (CD_AHB3PERIPH_BASE + 0x4000UL)
#define OCTOSPI1_R_BASE       (CD_AHB3PERIPH_BASE + 0x5000UL)
#define DLYB_OCTOSPI1_BASE    (CD_AHB3PERIPH_BASE + 0x6000UL)
#define SDMMC1_BASE           (CD_AHB3PERIPH_BASE + 0x7000UL)
#define DLYB_SDMMC1_BASE      (CD_AHB3PERIPH_BASE + 0x8000UL)
#define RAMECC_BASE           (CD_AHB3PERIPH_BASE + 0x9000UL)
#define OCTOSPI2_R_BASE       (CD_AHB3PERIPH_BASE + 0xA000UL)
#define DLYB_OCTOSPI2_BASE    (CD_AHB3PERIPH_BASE + 0xB000UL)
#define OCTOSPIM_BASE         (CD_AHB3PERIPH_BASE + 0xB400UL)

/*!< CD_AHB1PERIPH peripherals */

#define DMA1_BASE               (CD_AHB1PERIPH_BASE + 0x0000UL)
#define DMA2_BASE               (CD_AHB1PERIPH_BASE + 0x0400UL)
#define DMAMUX1_BASE            (CD_AHB1PERIPH_BASE + 0x0800UL)
#define ADC1_BASE               (CD_AHB1PERIPH_BASE + 0x2000UL)
#define ADC2_BASE               (CD_AHB1PERIPH_BASE + 0x2100UL)
#define ADC12_COMMON_BASE       (CD_AHB1PERIPH_BASE + 0x2300UL)
#define CRC_BASE                (CD_AHB1PERIPH_BASE + 0x3000UL)

/*!< USB registers base address */
#define USB1_OTG_HS_PERIPH_BASE              (0x40040000UL)
#define USB_OTG_GLOBAL_BASE                  (0x000UL)
#define USB_OTG_DEVICE_BASE                  (0x800UL)
#define USB_OTG_IN_ENDPOINT_BASE             (0x900UL)
#define USB_OTG_OUT_ENDPOINT_BASE            (0xB00UL)
#define USB_OTG_EP_REG_SIZE                  (0x20UL)
#define USB_OTG_HOST_BASE                    (0x400UL)
#define USB_OTG_HOST_PORT_BASE               (0x440UL)
#define USB_OTG_HOST_CHANNEL_BASE            (0x500UL)
#define USB_OTG_HOST_CHANNEL_SIZE            (0x20UL)
#define USB_OTG_PCGCCTL_BASE                 (0xE00UL)
#define USB_OTG_FIFO_BASE                    (0x1000UL)
#define USB_OTG_FIFO_SIZE                    (0x1000UL)

/*!< CD_AHB2PERIPH peripherals */

#define DCMI_BASE              (CD_AHB2PERIPH_BASE + 0x0000UL)
#define PSSI_BASE              (CD_AHB2PERIPH_BASE + 0x0400UL)
#define HSEM_BASE              (CD_AHB2PERIPH_BASE + 0x0800UL)
#define CRYP_BASE              (CD_AHB2PERIPH_BASE + 0x1000UL)
#define HASH_BASE              (CD_AHB2PERIPH_BASE + 0x1400UL)
#define HASH_DIGEST_BASE       (CD_AHB2PERIPH_BASE + 0x1710UL)
#define RNG_BASE               (CD_AHB2PERIPH_BASE + 0x1800UL)
#define SDMMC2_BASE            (CD_AHB2PERIPH_BASE + 0x2400UL)
#define DLYB_SDMMC2_BASE       (CD_AHB2PERIPH_BASE + 0x2800UL)
#define BDMA1_BASE             (CD_AHB2PERIPH_BASE + 0x2C00UL)

/*!< SRD_AHB4PERIPH peripherals */
#define GPIOA_BASE            (SRD_AHB4PERIPH_BASE + 0x0000UL)
#define GPIOB_BASE            (SRD_AHB4PERIPH_BASE + 0x0400UL)
#define GPIOC_BASE            (SRD_AHB4PERIPH_BASE + 0x0800UL)
#define GPIOD_BASE            (SRD_AHB4PERIPH_BASE + 0x0C00UL)
#define GPIOE_BASE            (SRD_AHB4PERIPH_BASE + 0x1000UL)
#define GPIOF_BASE            (SRD_AHB4PERIPH_BASE + 0x1400UL)
#define GPIOG_BASE            (SRD_AHB4PERIPH_BASE + 0x1800UL)
#define GPIOH_BASE            (SRD_AHB4PERIPH_BASE + 0x1C00UL)
#define GPIOI_BASE            (SRD_AHB4PERIPH_BASE + 0x2000UL)
#define GPIOJ_BASE            (SRD_AHB4PERIPH_BASE + 0x2400UL)
#define GPIOK_BASE            (SRD_AHB4PERIPH_BASE + 0x2800UL)
#define RCC_BASE              (SRD_AHB4PERIPH_BASE + 0x4400UL)
#define PWR_BASE              (SRD_AHB4PERIPH_BASE + 0x4800UL)
#define BDMA2_BASE            (SRD_AHB4PERIPH_BASE + 0x5400UL)
#define DMAMUX2_BASE          (SRD_AHB4PERIPH_BASE + 0x5800UL)

/*!< CD_APB3PERIPH peripherals */
#define LTDC_BASE             (CD_APB3PERIPH_BASE + 0x1000UL)
#define LTDC_Layer1_BASE      (LTDC_BASE + 0x84UL)
#define LTDC_Layer2_BASE      (LTDC_BASE + 0x104UL)
#define WWDG1_BASE            (CD_APB3PERIPH_BASE + 0x3000UL)

/*!< CD_APB1PERIPH peripherals */
#define TIM2_BASE             (CD_APB1PERIPH_BASE + 0x0000UL)
#define TIM3_BASE             (CD_APB1PERIPH_BASE + 0x0400UL)
#define TIM4_BASE             (CD_APB1PERIPH_BASE + 0x0800UL)
#define TIM5_BASE             (CD_APB1PERIPH_BASE + 0x0C00UL)
#define TIM6_BASE             (CD_APB1PERIPH_BASE + 0x1000UL)
#define TIM7_BASE             (CD_APB1PERIPH_BASE + 0x1400UL)
#define TIM12_BASE            (CD_APB1PERIPH_BASE + 0x1800UL)
#define TIM13_BASE            (CD_APB1PERIPH_BASE + 0x1C00UL)
#define TIM14_BASE            (CD_APB1PERIPH_BASE + 0x2000UL)
#define LPTIM1_BASE           (CD_APB1PERIPH_BASE + 0x2400UL)

#define SPI2_BASE             (CD_APB1PERIPH_BASE + 0x3800UL)
#define SPI3_BASE             (CD_APB1PERIPH_BASE + 0x3C00UL)
#define SPDIFRX_BASE          (CD_APB1PERIPH_BASE + 0x4000UL)
#define USART2_BASE           (CD_APB1PERIPH_BASE + 0x4400UL)
#define USART3_BASE           (CD_APB1PERIPH_BASE + 0x4800UL)
#define UART4_BASE            (CD_APB1PERIPH_BASE + 0x4C00UL)
#define UART5_BASE            (CD_APB1PERIPH_BASE + 0x5000UL)
#define I2C1_BASE             (CD_APB1PERIPH_BASE + 0x5400UL)
#define I2C2_BASE             (CD_APB1PERIPH_BASE + 0x5800UL)
#define I2C3_BASE             (CD_APB1PERIPH_BASE + 0x5C00UL)
#define CEC_BASE              (CD_APB1PERIPH_BASE + 0x6C00UL)
#define DAC1_BASE             (CD_APB1PERIPH_BASE + 0x7400UL)
#define UART7_BASE            (CD_APB1PERIPH_BASE + 0x7800UL)
#define UART8_BASE            (CD_APB1PERIPH_BASE + 0x7C00UL)
#define CRS_BASE              (CD_APB1PERIPH_BASE + 0x8400UL)
#define SWPMI1_BASE           (CD_APB1PERIPH_BASE + 0x8800UL)
#define OPAMP_BASE            (CD_APB1PERIPH_BASE + 0x9000UL)
#define OPAMP1_BASE           (CD_APB1PERIPH_BASE + 0x9000UL)
#define OPAMP2_BASE           (CD_APB1PERIPH_BASE + 0x9010UL)
#define MDIOS_BASE            (CD_APB1PERIPH_BASE + 0x9400UL)
#define FDCAN1_BASE           (CD_APB1PERIPH_BASE + 0xA000UL)
#define FDCAN2_BASE           (CD_APB1PERIPH_BASE + 0xA400UL)
#define FDCAN_CCU_BASE        (CD_APB1PERIPH_BASE + 0xA800UL)
#define SRAMCAN_BASE          (CD_APB1PERIPH_BASE + 0xAC00UL)

/*!< CD_APB2PERIPH peripherals */

#define TIM1_BASE             (CD_APB2PERIPH_BASE + 0x0000UL)
#define TIM8_BASE             (CD_APB2PERIPH_BASE + 0x0400UL)
#define USART1_BASE           (CD_APB2PERIPH_BASE + 0x1000UL)
#define USART6_BASE           (CD_APB2PERIPH_BASE + 0x1400UL)
#define UART9_BASE            (CD_APB2PERIPH_BASE + 0x1800UL)
#define USART10_BASE          (CD_APB2PERIPH_BASE + 0x1C00UL)
#define SPI1_BASE             (CD_APB2PERIPH_BASE + 0x3000UL)
#define SPI4_BASE             (CD_APB2PERIPH_BASE + 0x3400UL)
#define TIM15_BASE            (CD_APB2PERIPH_BASE + 0x4000UL)
#define TIM16_BASE            (CD_APB2PERIPH_BASE + 0x4400UL)
#define TIM17_BASE            (CD_APB2PERIPH_BASE + 0x4800UL)
#define SPI5_BASE             (CD_APB2PERIPH_BASE + 0x5000UL)
#define SAI1_BASE             (CD_APB2PERIPH_BASE + 0x5800UL)
#define SAI1_Block_A_BASE     (SAI1_BASE + 0x004UL)
#define SAI1_Block_B_BASE     (SAI1_BASE + 0x024UL)
#define SAI2_BASE             (CD_APB2PERIPH_BASE + 0x5C00UL)
#define SAI2_Block_A_BASE     (SAI2_BASE + 0x004UL)
#define SAI2_Block_B_BASE     (SAI2_BASE + 0x024UL)
#define DFSDM1_BASE           (CD_APB2PERIPH_BASE + 0x7800UL)
#define DFSDM1_Channel0_BASE  (DFSDM1_BASE + 0x00UL)
#define DFSDM1_Channel1_BASE  (DFSDM1_BASE + 0x20UL)
#define DFSDM1_Channel2_BASE  (DFSDM1_BASE + 0x40UL)
#define DFSDM1_Channel3_BASE  (DFSDM1_BASE + 0x60UL)
#define DFSDM1_Channel4_BASE  (DFSDM1_BASE + 0x80UL)
#define DFSDM1_Channel5_BASE  (DFSDM1_BASE + 0xA0UL)
#define DFSDM1_Channel6_BASE  (DFSDM1_BASE + 0xC0UL)
#define DFSDM1_Channel7_BASE  (DFSDM1_BASE + 0xE0UL)
#define DFSDM1_Filter0_BASE   (DFSDM1_BASE + 0x100UL)
#define DFSDM1_Filter1_BASE   (DFSDM1_BASE + 0x180UL)
#define DFSDM1_Filter2_BASE   (DFSDM1_BASE + 0x200UL)
#define DFSDM1_Filter3_BASE   (DFSDM1_BASE + 0x280UL)
#define DFSDM1_Filter4_BASE   (DFSDM1_BASE + 0x300UL)
#define DFSDM1_Filter5_BASE   (DFSDM1_BASE + 0x380UL)
#define DFSDM1_Filter6_BASE   (DFSDM1_BASE + 0x400UL)
#define DFSDM1_Filter7_BASE   (DFSDM1_BASE + 0x480UL)
/*!< SRD_APB4PERIPH peripherals */
#define EXTI_BASE             (SRD_APB4PERIPH_BASE + 0x0000UL)
#define EXTI_D1_BASE          (EXTI_BASE + 0x0080UL)
#define SYSCFG_BASE           (SRD_APB4PERIPH_BASE + 0x0400UL)
#define LPUART1_BASE          (SRD_APB4PERIPH_BASE + 0x0C00UL)
#define SPI6_BASE             (SRD_APB4PERIPH_BASE + 0x1400UL)
#define I2C4_BASE             (SRD_APB4PERIPH_BASE + 0x1C00UL)
#define LPTIM2_BASE           (SRD_APB4PERIPH_BASE + 0x2400UL)
#define LPTIM3_BASE           (SRD_APB4PERIPH_BASE + 0x2800UL)
#define DAC2_BASE             (SRD_APB4PERIPH_BASE + 0x3400UL)
#define COMP12_BASE           (SRD_APB4PERIPH_BASE + 0x3800UL)
#define COMP1_BASE            (COMP12_BASE + 0x0CUL)
#define COMP2_BASE            (COMP12_BASE + 0x10UL)
#define VREFBUF_BASE          (SRD_APB4PERIPH_BASE + 0x3C00UL)
#define RTC_BASE              (SRD_APB4PERIPH_BASE + 0x4000UL)
#define TAMP_BASE             (SRD_APB4PERIPH_BASE + 0x4400UL)
#define IWDG1_BASE            (SRD_APB4PERIPH_BASE + 0x4800UL)

#define DTS_BASE              (SRD_APB4PERIPH_BASE + 0x6800UL)

